Taxi/billing-test-data/billing-subventions-0min-referral/data/driver_referral_payment.json

[
    {
        "json": {
            "data": {
                "amount": "4000",
                "currency": "RUB",
                "db_id": "8719dd46a3e94fc2813a540495602bff",
                "driver_license": "3141592654",
                "due": "2019-10-10T03:35:04.199278+00:00",
                "invite_id": "4df61e4e874ebb84c58f0a5b2bb2efed",
                "invited_driver": "Торвальдс Линус",
                "park_id": "400000004100",
                "uuid": "65c30e72bc4b4ce38aca69b0586c165a"
            },
            "event_at": "2020-01-10T00:15:17Z",
            "external_event_ref": "driver_referral_payment/12345678/subventions_update_needed",
            "external_obj_id": "driver_referrals/7bad46f1300625cfba0cc8bca6ade202",
            "journal_entries": [],
            "kind": "driver_referral_payment",
            "service": "billing-orders",
            "status": "new"
        }
    }
]
